//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2021, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************

/**
    @file Ntp.uni
    String definitions for Ntp Setup.
**/

/=#
#include "VFR.uni"

// 
//  New modules that are intended to support AmiPkg_11 or newer (which part of Core 5.009)  
//  has to include the following line at the beginning of their uni files:
//
#include "AmiLanguageDefinitions.uni"

//
//  Modules that are intended to support older versions of AmiPkg has to include 
//  the following line at the beginning of their uni files:
//
#ifndef x-UEFI-AMI
#langdef  x-UEFI-AMI "x-UEFI-AMI"    // AMI Configuration Language
#endif

#string STR_NTP_SYNCHRONIZATION                 #language en-US "NTP Synchronization"
                                                #language x-UEFI-AMI "NTP000"
#string STR_NTP_SYNCHRONIZATION_HELP            #language en-US "Update system time with NTP time."
                                                #language x-UEFI-AMI "NTP001"

#string STR_NTP_CONFIGURATION                   #language en-US "NTP Configuration"
                                                #language x-UEFI-AMI "NTP002"
#string STR_NTP_CONFIGURATION_HELP              #language en-US "IP configuration and NTP setting for NTP synchronization."
                                                #language x-UEFI-AMI "NTP003"

#string STR_NTP_SUPPORT_ENABLE                  #language en-US "NTP Support"
                                                #language x-UEFI-AMI "NTP004"
#string STR_NTP_SUPPORT_ENABLE_HELP             #language en-US "Enable or disable NTP."
                                                #language x-UEFI-AMI "NTP005"

#string STR_ENABLED                             #language en-US "Enabled"
                                                #language x-UEFI-AMI "NTP006"
#string STR_DISABLED                            #language en-US "Disabled"
                                                #language x-UEFI-AMI "NTP007"

#string STR_NTP_CONFIG_LOCAL_IP                 #language en-US "IP Configuration"
                                                #language x-UEFI-AMI "NTP008"
#string STR_NTP_CONFIG_LOCAL_IP_HELP            #language en-US "Select type (dhcp or static) for local IPv4 configuration."
                                                #language x-UEFI-AMI "NTP009"

#string STR_NTP_CONFIG_LOCAL_IP_DYNAMIC         #language en-US "Dhcp"
                                                #language x-UEFI-AMI "NTP00A"
#string STR_NTP_CONFIG_LOCAL_IP_STATIC          #language en-US "Static"
                                                #language x-UEFI-AMI "NTP00B"
#string STR_LOCAL_IP_ADDRESS                    #language en-US "IP address"
                                                #language x-UEFI-AMI "NTP00C"
#string STR_LOCAL_IP_ADDRESS_HELP               #language en-US "Provide local IPv4 address."
                                                #language x-UEFI-AMI "NTP00D"
#string STR_SUBNETMASK_IP_ADDRESS               #language en-US "Subnet Mask"
                                                #language x-UEFI-AMI "NTP00E"
#string STR_SUBNETMASK_IP_ADDRESS_HELP          #language en-US "Provide Subnet Mask."
                                                #language x-UEFI-AMI "NTP00F"
#string STR_GATEWAY_IP_ADDRESS                  #language en-US "Default Gateway"
                                                #language x-UEFI-AMI "NTP010"
#string STR_GATEWAY_IP_ADDRESS_HELP             #language en-US "Provide Default Gateway."
                                                #language x-UEFI-AMI "NTP011"
#string STR_PRIMARY_DNS_SERVER_IP_ADDRESS       #language en-US "DNS server"
                                                #language x-UEFI-AMI "NTP012"
#string STR_PRIMARY_DNS_SERVER_IP_ADDRESS_HELP  #language en-US "Provide primary DNS server."
                                                #language x-UEFI-AMI "NTP013"

#string STR_NTP_CONFIG_SERVER_HOST_NAME         #language en-US "NTP Server Name"
                                                #language x-UEFI-AMI "NTP014"
#string STR_NTP_CONFIG_SERVER_HOST_NAME_HELP    #language en-US "Select a NTP server hostname or manual input."
                                                #language x-UEFI-AMI "NTP015"
#string STR_NTP_CONFIG_SERVER_HOST_NAME_MANUAL  #language en-US "Manual"
                                                #language x-UEFI-AMI "NTP016"
#string STR_SERVER_HOST_NAME                    #language en-US "Server Name"
                                                #language x-UEFI-AMI "NTP017"
#string STR_SERVER_HOST_NAME_HELP               #language en-US "Provide NTP server hostname."
                                                #language x-UEFI-AMI "NTP018"
#string STR_NTP_CONFIG_SERVER_HOST_NAME_DEFAULT #language en-US ""
                                                #language x-UEFI-AMI "NTP019"

#string STR_NTP_TIME_OUT                        #language en-US "NTP Time out"
                                                #language x-UEFI-AMI "NTP01A"
#string STR_NTP_TIME_OUT_HELP                   #language en-US "Maximum waiting time in seconds for NTP response."
                                                #language x-UEFI-AMI "NTP01B"

#string STR_NTP_TIME_ZONE                       #language en-US "Time Zone"
                                                #language x-UEFI-AMI "NTP01C"
#string STR_NTP_TIME_ZONE_HELP                  #language en-US "Select Time Zone."  
                                                #language x-UEFI-AMI "NTP01D"

#string STR_NTP_DAYLIGHT_SAVING                 #language en-US "Daylight Saving Time"
                                                #language x-UEFI-AMI "NTP01E"
#string STR_NTP_DAYLIGHT_SAVING_HELP            #language en-US "Enable or disable Daylight Saving Time"
                                                #language x-UEFI-AMI "NTP01F"

#string STR_NTP_UPDATE_TIME                     #language en-US "Synchronize NTP Time"
                                                #language x-UEFI-AMI "NTP020"
#string STR_NTP_UPDATE_TIME_HELP                #language en-US "Update the system time and date with NTP time along with Time Zone and Daylight Saving Time."
                                                #language x-UEFI-AMI "NTP021"

#string STR_NTP_DISPLAY_TITLE_ERROR             #language en-US "Error"
                                                #language x-UEFI-AMI "NTP024"
#string STR_NTP_DISPLAY_TITLE_SYNC              #language en-US "Synchronization"
                                                #language x-UEFI-AMI "NTP025"
#string STR_NTP_DISPLAY_MSG_SYNC_WAIT           #language en-US "Please wait for synchronizing"
                                                #language x-UEFI-AMI "NTP026"
#string STR_NTP_DISPLAY_TITLE_TIME_UPDATE       #language en-US "System Time Updated"
                                                #language x-UEFI-AMI "NTP027"
#string STR_NTP_DISPLAY_MSG_TIME_UPDATE_FAILED  #language en-US "Time synchronization failed!"
                                                #language x-UEFI-AMI "NTP028"
#string STR_NTP_DISPLAY_TITLE_CONFIG_FAILED     #language en-US "Configuration Unavailable"
                                                #language x-UEFI-AMI "NTP029"
#string STR_NTP_DISPLAY_MSG_CONFIG_CHECK        #language en-US "Please check the configuration."
                                                #language x-UEFI-AMI "NTP02A"
#string STR_NTP_DISPLAY_MSG_CONFIG_RETRY        #language en-US "Please reset system and try again."
                                                #language x-UEFI-AMI "NTP02B"
#string STR_NTP_DISPLAY_TITLE_CONFIG_CHANGED    #language en-US "Configuration Changed"
                                                #language x-UEFI-AMI "NTP02C"
#string STR_NTP_DISPLAY_MSG_CONFIG_SAVE         #language en-US "Please go to 'Save & Exit' page to save changes and reset system."
                                                #language x-UEFI-AMI "NTP02D"
#string STR_NTP_DISPLAY_TITLE_SYNC_CONFIRM      #language en-US "Time Synchronization Confirm"
                                                #language x-UEFI-AMI "NTP02E"
#string STR_NTP_DISPLAY_MSG_SYNC_CONFIRM        #language en-US "System time will be updated immediately.\nPlease select [Yes] to confirm this operation, or [No] to exit."
                                                #language x-UEFI-AMI "NTP02F"

#string STR_NTP_DISPLAY_ERROR_MSG_IP_CONFIG     #language en-US "Configure local IP addresses failed!"
                                                #language x-UEFI-AMI "NTP030"
#string STR_NTP_DISPLAY_ERROR_MSG_NTP_RETRY     #language en-US "No response for NTP server resolution. Please try again."
                                                #language x-UEFI-AMI "NTP031"
#string STR_NTP_DISPLAY_ERROR_MSG_NTP_CONFIG    #language en-US "Configure NTP server failed!"
                                                #language x-UEFI-AMI "NTP032"
#string STR_NTP_DISPLAY_ERROR_MSG_ANY           #language en-US "Something Error!"
                                                #language x-UEFI-AMI "NTP033"
#string STR_NTP_DISPLAY_ERROR_MSG_RESPONSE      #language en-US "Configure or receive response failed!"
                                                #language x-UEFI-AMI "NTP034"
#string STR_NTP_DISPLAY_ERROR_MSG_REQUEST       #language en-US "Configure or send request failed!"
                                                #language x-UEFI-AMI "NTP035"
#string STR_NTP_DISPLAY_ERROR_MSG_TIMER_EVENT   #language en-US "Trigger timer event failed!"
                                                #language x-UEFI-AMI "NTP036"
#string STR_NTP_DISPLAY_ERROR_MSG_INVALID_IP    #language en-US "Invalid IP Address!"
                                                #language x-UEFI-AMI "NTP037"

#string STR_TIME_ZONE_MINUS_12                  #language en-US "UTC-12:00, International Date Line West"
                                                #language x-UEFI-AMI "NTP038"
#string STR_TIME_ZONE_MINUS_11                  #language en-US "UTC-11:00, Midway Island, Samoa"
                                                #language x-UEFI-AMI "NTP039"
#string STR_TIME_ZONE_MINUS_10                  #language en-US "UTC-10:00, Hawaii"
                                                #language x-UEFI-AMI "NTP03A"
#string STR_TIME_ZONE_MINUS_9                   #language en-US "UTC-09:00, Alaska"
                                                #language x-UEFI-AMI "NTP03B"
#string STR_TIME_ZONE_MINUS_8                   #language en-US "UTC-08:00, Pacific Time(US & Canada), Tijuana, Portland"
                                                #language x-UEFI-AMI "NTP03C"
#string STR_TIME_ZONE_MINUS_7                   #language en-US "UTC-07:00, Arizona, Chihuahua, La Paz, Mazatlan, Mountain Time(US & Canada)"
                                                #language x-UEFI-AMI "NTP03D"
#string STR_TIME_ZONE_MINUS_6                   #language en-US "UTC-06:00, Central America, Central Time(US & Canada)"
                                                #language x-UEFI-AMI "NTP03E"
#string STR_TIME_ZONE_MINUS_5                   #language en-US "UTC-05:00, Bogota, Lima, Quito, Eastern Time(US & Canada)"
                                                #language x-UEFI-AMI "NTP03F"
#string STR_TIME_ZONE_MINUS_4_30                #language en-US "UTC-04:30, Caracas"
                                                #language x-UEFI-AMI "NTP040"
#string STR_TIME_ZONE_MINUS_4                   #language en-US "UTC-04:00, Atlantic Time(Canada), Caracas, Santiago"
                                                #language x-UEFI-AMI "NTP041"
#string STR_TIME_ZONE_MINUS_3_30                #language en-US "UTC-03:30, Newfoundland"
                                                #language x-UEFI-AMI "NTP042"
#string STR_TIME_ZONE_MINUS_3                   #language en-US "UTC-03:00, Brasilia, Buenos Aires, Georgetown, Greenland"
                                                #language x-UEFI-AMI "NTP043"
#string STR_TIME_ZONE_MINUS_2                   #language en-US "UTC-02:00, Mid-Atlantic"
                                                #language x-UEFI-AMI "NTP044"
#string STR_TIME_ZONE_MINUS_1                   #language en-US "UTC-01:00, Azores, Cape Verde Is."
                                                #language x-UEFI-AMI "NTP045"
#string STR_TIME_ZONE_0                         #language en-US "UTC      , Greenwich Mean Time, Casablanca, Monrovia, Dublin, London"
                                                #language x-UEFI-AMI "NTP046"
#string STR_TIME_ZONE_PLUS_1                    #language en-US "UTC+01:00, Amsterdam, Berlin, Bern, Rome, Paris, West Central Africa"
                                                #language x-UEFI-AMI "NTP047"
#string STR_TIME_ZONE_PLUS_2                    #language en-US "UTC+02:00, Athens, Istanbul, Bucharest, Cairo, Jerusalem"
                                                #language x-UEFI-AMI "NTP048"
#string STR_TIME_ZONE_PLUS_3                    #language en-US "UTC+03:00, Baghdad, Kuwait, Riyadh, Moscow, Nairobi"
                                                #language x-UEFI-AMI "NTP049"
#string STR_TIME_ZONE_PLUS_3_30                 #language en-US "UTC+03:30, Tehran"
                                                #language x-UEFI-AMI "NTP04A"
#string STR_TIME_ZONE_PLUS_4                    #language en-US "UTC+04:00, Abu Dhabi, Muscat, Baku, Tbilisi, Yerevan"
                                                #language x-UEFI-AMI "NTP04B"
#string STR_TIME_ZONE_PLUS_4_30                 #language en-US "UTC+04:30, Kabul"
                                                #language x-UEFI-AMI "NTP04C"
#string STR_TIME_ZONE_PLUS_5                    #language en-US "UTC+05:00, Ekaterinburg, Islamabad, Karachi, Tashkent"
                                                #language x-UEFI-AMI "NTP04D"
#string STR_TIME_ZONE_PLUS_5_30                 #language en-US "UTC+05:30, Chennai, Kolkata, Mumbai, New Delhi"
                                                #language x-UEFI-AMI "NTP04E"
#string STR_TIME_ZONE_PLUS_5_45                 #language en-US "UTC+05:45, Kathmandu"
                                                #language x-UEFI-AMI "NTP04F"
#string STR_TIME_ZONE_PLUS_6                    #language en-US "UTC+06:00, Almaty, Novosibirsk, Astana, Dhaka, Sri Jayawardenepura"
                                                #language x-UEFI-AMI "NTP050"
#string STR_TIME_ZONE_PLUS_6_30                 #language en-US "UTC+06:30, Rangoon"
                                                #language x-UEFI-AMI "NTP051"
#string STR_TIME_ZONE_PLUS_7                    #language en-US "UTC+07:00, Bangkok, Hanio, Jakarta, Krasnoyarsk"
                                                #language x-UEFI-AMI "NTP052"
#string STR_TIME_ZONE_PLUS_8                    #language en-US "UTC+08:00, Beijing, Chongqing, Hong Kong, Urumqi, Taipei, Perth"
                                                #language x-UEFI-AMI "NTP053"
#string STR_TIME_ZONE_PLUS_9                    #language en-US "UTC+09:00, Osaka, Sapporo, Tokyo, Seoul, Yakutsk"
                                                #language x-UEFI-AMI "NTP054"
#string STR_TIME_ZONE_PLUS_9_30                 #language en-US "UTC+09:30, Adelaide, Darwin"
                                                #language x-UEFI-AMI "NTP055"
#string STR_TIME_ZONE_PLUS_10                   #language en-US "UTC+10:00, Canberra, Melbourne, Sydney, Guam, Hobart, Vladivostok"
                                                #language x-UEFI-AMI "NTP056"
#string STR_TIME_ZONE_PLUS_11                   #language en-US "UTC+11:00, Magadan, Solomon Is., New Caledonia"
                                                #language x-UEFI-AMI "NTP057"
#string STR_TIME_ZONE_PLUS_12                   #language en-US "UTC+12:00, Auckland, Wellington, Fiji, Kamchatka, Marshall Is."
                                                #language x-UEFI-AMI "NTP058"
#string STR_TIME_ZONE_PLUS_13                   #language en-US "UTC+13:00, Nuku'alofa"
                                                #language x-UEFI-AMI "NTP059"
#string STR_TIME_ZONE_PLUS_14                   #language en-US "UTC+14:00, Line Islands"
                                                #language x-UEFI-AMI "NTP05A"
